<a href="https://colab.research.google.com/github/HemersonFarias/DataScience/blob/main/Challenge_looq.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
!pip install mysql-connector-python

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.29-cp37-cp37m-manylinux1_x86_64.whl (25.2 MB)
     |████████████████████████████████| 25.2 MB 1.7 MB/s
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.29

## Código que pegar usuário e senha (correto)

In [ ]:
import mysql.connector
from getpass import getpass


mydb = mysql.connector.connect(user=input("Enter username: "),  
                               password=getpass("Enter password: "), 
                               host='35.199.127.241', 
                               database='looqbox_challenge'
)

mycursor = mydb.cursor()

mycursor.execute("SELECT PRODUCT_COD, PRODUCT_NAME, PRODUCT_VAL AS 'PRODUCT VALUE' FROM data_product order by PRODUCT_VAL DESC LIMIT 10; ")

myresult = mycursor.fetchall()
for x in myresult:
  print(x)

## Question 1

In [ ]:
import mysql.connector
from getpass import getpass


mycursor = mydb.cursor()

In [ ]:
mycursor.execute("SELECT * FROM data_product_sales LIMIT 1000")

myresult = mycursor.fetchall()

In [ ]:
data = pd.DataFrame(myresult, columns = ['Store_cod', 'Product_code', 'Date', 'Sales_value', 'Sales_qty'])

In [ ]:
data

    Store_cod  Product_code        Date Sales_value Sales_qty
0           1            18  2019-01-01      708.50        65
1           1            18  2019-01-02     1297.10       119
2           1            18  2019-01-03     1144.50       105
3           1            18  2019-01-04     1090.00       100
4           1            18  2019-01-05      893.80        82
..        ...           ...         ...         ...       ...
995         1            48  2016-08-15      547.68       112
996         1            48  2016-08-16      679.71       139
997         1            48  2016-08-17      953.55       195
998         1            48  2016-08-18      787.29       161
999         1            48  2016-08-19      792.18       162

[1000 rows x 5 columns]

In [ ]:
from_db = []

In [ ]:
for myresult in myresult:
  myresult = myresult
  from_db.append(myresult)

In [ ]:
myresult

('1', 48, datetime.date(2016, 8, 19), Decimal('792.18'), Decimal('162'))

# Question 2

## Importing

In [233]:
mycursor.execute("SELECT STORE_CODE, STORE_NAME, START_DATE, END_DATE, BUSINESS_NAME, BUSINESS_CODE FROM data_store_cad LIMIT 100") #use query 1
query1 = mycursor.fetchall() #fetches all results and put in query1
query1   #show query 1

[(1, 'Sao Paulo', '2006-10-01', '', 'Varejo', 1),
 (2, 'Chicago', '2007-10-01', '', 'Varejo', 1),
 (3, 'Roma', '2008-10-01', '', 'Varejo', 1),
 (4, 'Tokio', '2009-10-01', '', 'Varejo', 1),
 (5, 'Paris', '2019-01-01', '', 'Proximidade', 2),
 (6, 'Berlin', '2011-10-01', '', 'Proximidade', 2),
 (7, 'New York', '2012-10-01', '', 'Proximidade', 2),
 (8, 'Belem', '2013-10-01', '', 'Proximidade', 2),
 (9, 'London', '2014-10-01', '', 'Farma', 4),
 (10, 'Hong Kong', '2019-01-01', '', 'Farma', 4),
 (11, 'Rio de Janeiro', '2019-01-01', '', 'Farma', 4),
 (12, 'Madri', '2019-01-01', '', 'Farma', 4),
 (13, 'Dubai', '2019-01-01', '', 'Atacado', 5),
 (14, 'Bahia', '2019-01-01', '', 'Atacado', 5),
 (15, 'Buenos Aires', '2019-01-01', '', 'Atacado', 5),
 (16, 'Salvador', '2019-01-01', '', 'Atacado', 5),
 (17, 'Sidney', '2019-01-01', '', 'Posto', 3),
 (18, 'Bangkok', '2019-01-01', '', 'Posto', 3),
 (19, 'Miami', '2019-01-01', '', 'Posto', 3),
 (20, 'Vancouver', '2019-01-01', '', 'Posto', 3)]

In [234]:
mycursor.execute("SELECT STORE_CODE, DATE, SALES_VALUE, SALES_QTY FROM data_store_sales WHERE DATE BETWEEN '2019-01-01' AND '2019-12-31'") #use query 2
query2 = mycursor.fetchall() #fetches all results and put in query2
#query2 #show query2

## Transforming Data

In [203]:
df1 = pd.DataFrame(query1, columns = ['Store_cod', 'Product_code', 'Start_Date','End_Date', 'Business_Name', 'Business_code']) #tranform query 1 to dataframe and chose the name of columns
df2 = pd.DataFrame(query2, columns = ['Store_cod', 'Date', 'Sale_value', 'Sales_qty']) ##tranform query 2 to dataframe and chose the name of columns

In [204]:
df1.Start_Date.dtypes #check type of column

dtype('O')

In [205]:
df1['Start_Date'] = pd.to_datetime(df1.Start_Date) #transform to date  the columns Start_Date, because was imported as object
df2['Date'] = pd.to_datetime(df2.Date) #transform to date  the columns Date

## Filtering Data

In [206]:
df2 = df2[(df2['Date'] > '2019-12-01') & (df2['Date'] < '2019-12-31')] #filter query 2 as asked

## Calculate ticket value

In [207]:
df2['Ticket'] = df2.Sale_value/df2.Sales_qty #Calculate ticket value

In [208]:
df2

      Store_cod       Date  Sale_value  Sales_qty     Ticket
6700          1 2019-12-02   170756.36      11085  15.404272
6701         10 2019-12-02   122944.35       4649  26.445332
6702         11 2019-12-02   222921.67       7513  29.671459
6703         12 2019-12-02   197926.09       6797  29.119625
6704         13 2019-12-02   170756.36      11085  15.404272
...         ...        ...         ...        ...        ...
7275          5 2019-12-30   169775.21      11035  15.385157
7276          6 2019-12-30   169775.21      11035  15.385157
7277          7 2019-12-30   169775.21      11035  15.385157
7278          8 2019-12-30   168003.11      10936  15.362391
7279          9 2019-12-30   154459.78       5328  28.990199

[580 rows x 5 columns]

## Merge the columns

In [209]:
df0 = pd.merge(df2, df1, on = 'Store_cod') #merge two columns (query1 and query2)
df0

,Store_cod,Date,Sale_value,Sales_qty,Ticket,Product_code,Start_Date,End_Date,Business_Name,Business_code
0,1,2019-12-02,170756.36,11085,15.404272,Sao Paulo,2006-10-01,,Varejo,1
1,1,2019-12-03,196899.17,12805,15.376741,Sao Paulo,2006-10-01,,Varejo,1
2,1,2019-12-04,341691.51,22195,15.394977,Sao Paulo,2006-10-01,,Varejo,1
3,1,2019-12-05,296725.34,19332,15.348921,Sao Paulo,2006-10-01,,Varejo,1
4,1,2019-12-06,244171.36,15800,15.453884,Sao Paulo,2006-10-01,,Varejo,1
...,...,...,...,...,...,...,...,...,...,...
575,9,2019-12-26,236975.89,8170,29.005617,London,2014-10-01,,Farma,4
576,9,2019-12-27,249839.86,8622,28.977019,London,2014-10-01,,Farma,4
577,9,2019-12-28,201536.13,6958,28.964664,London,2014-10-01,,Farma,4
578,9,2019-12-29,159300.08,5497,28.979458,London,2014-10-01,,Farma,4
579,9,2019-12-30,154459.78,5328,28.990199,London,2014-10-01,,Farma,4

## Choose the columns and rename

In [224]:
result_df = df0[['Product_code','Business_Name','Ticket']] #Choose just 3 columns to show on the result
#result_df = result_df.rename(columns ={'Product_code': 'Loja', 'Business_Name': 'Categoria'}) #rename columns

In [225]:
result = result_df.groupby(['Product_code','Business_Name'], as_index=False).agg('mean').round(2) #calculae meand from group Loja and Categoria

In [226]:
result = result.rename(columns ={'Product_code': 'Loja', 'Business_Name': 'Categoria', 'Ticket':'TM'}) #rename columns

In [229]:
result

              Loja    Categoria     TM
0            Bahia      Atacado  15.39
1          Bangkok        Posto  13.67
2            Belem  Proximidade  15.36
3           Berlin  Proximidade  15.39
4     Buenos Aires      Atacado  15.39
5          Chicago       Varejo  15.53
6            Dubai      Atacado  15.39
7        Hong Kong        Farma  26.32
8           London        Farma  29.00
9            Madri        Farma  29.01
10           Miami        Posto  13.67
11        New York  Proximidade  15.39
12           Paris  Proximidade  15.39
13  Rio de Janeiro        Farma  29.56
14            Roma       Varejo  15.39
15        Salvador      Atacado  15.39
16       Sao Paulo       Varejo  15.39
17          Sidney        Posto  13.67
18           Tokio       Varejo  15.39
19       Vancouver        Posto  13.67

# Question 3